1.: What does Pandas stand for?

Ans :- Python Data Analysis

2.: What is the primary data structure in Pandas for holding data?

Ans :- DataFrame

3.: How can you read a CSV file into a Pandas DataFrame?

Ans :- pd.read_csv("file.csv")

In [1]:
import pandas as pd
df = pd.read_csv('D:\pranit\Ed-Byte\Files\Covid_19_data.csv')
df

          Date     State          Region  Confirmed  Deaths  Recovered
0    4/29/2020       NaN     Afghanistan       1939      60        252
1    4/29/2020       NaN         Albania        766      30        455
2    4/29/2020       NaN         Algeria       3848     444       1702
3    4/29/2020       NaN         Andorra        743      42        423
4    4/29/2020       NaN          Angola         27       2          7
..         ...       ...             ...        ...     ...        ...
316  4/29/2020   Wyoming              US        545       7          0
317  4/29/2020  Xinjiang  Mainland China         76       3         73
318  4/29/2020     Yukon          Canada         11       0          0
319  4/29/2020    Yunnan  Mainland China        185       2        181
320  4/29/2020  Zhejiang  Mainland China       1268       1       1263

[321 rows x 6 columns]

4.: What does the head() function in Pandas do?

Ans :- Returns the first few rows of a DataFrame.

In [2]:
df.head()

        Date State       Region  Confirmed  Deaths  Recovered
0  4/29/2020   NaN  Afghanistan       1939      60        252
1  4/29/2020   NaN      Albania        766      30        455
2  4/29/2020   NaN      Algeria       3848     444       1702
3  4/29/2020   NaN      Andorra        743      42        423
4  4/29/2020   NaN       Angola         27       2          7

5.: How can you select a specific column 'column_name' from a DataFrame df?

Ans :- df['column_name']

In [3]:
df['Region']

0         Afghanistan
1             Albania
2             Algeria
3             Andorra
4              Angola
            ...
316                US
317    Mainland China
318            Canada
319    Mainland China
320    Mainland China
Name: Region, Length: 321, dtype: object

6.: What does the groupby() function in Pandas do?

Ans :- All of the above

In [7]:
gr = df.groupby('Region')['Confirmed'].sum()
print(gr)

Region
Afghanistan           1939
Albania                766
Algeria               3848
Andorra                743
Angola                  27
                      ...
West Bank and Gaza     344
Western Sahara           6
Yemen                    6
Zambia                  97
Zimbabwe                32
Name: Confirmed, Length: 187, dtype: int64

7.: How can you remove rows with missing values from a DataFrame df?

Ans :- df.dropna()

In [8]:
df.dropna()

          Date     State          Region  Confirmed  Deaths  Recovered
181  4/29/2020   Alabama              US       6912     256          0
182  4/29/2020    Alaska              US        355       9          0
183  4/29/2020   Alberta          Canada       5165      87          0
184  4/29/2020  Anguilla              UK          3       0          3
185  4/29/2020     Anhui  Mainland China        991       6        985
..         ...       ...             ...        ...     ...        ...
316  4/29/2020   Wyoming              US        545       7          0
317  4/29/2020  Xinjiang  Mainland China         76       3         73
318  4/29/2020     Yukon          Canada         11       0          0
319  4/29/2020    Yunnan  Mainland China        185       2        181
320  4/29/2020  Zhejiang  Mainland China       1268       1       1263

[140 rows x 6 columns]

8.: What does the merge() function in Pandas do?

Ans :- Merges DataFrames based on a common column.

9.: How can you rename the column 'old_name' to 'new_name' in a DataFrame df?

Ans :- df.rename(columns={'old_name': 'new_name'})

In [13]:
rename = df.rename(columns={'Region':'Country'})
rename.head()

        Date State      Country  Confirmed  Deaths  Recovered
0  4/29/2020   NaN  Afghanistan       1939      60        252
1  4/29/2020   NaN      Albania        766      30        455
2  4/29/2020   NaN      Algeria       3848     444       1702
3  4/29/2020   NaN      Andorra        743      42        423
4  4/29/2020   NaN       Angola         27       2          7

10.: What is the purpose of the pivot_table() function in Pandas?

Ans :- Creates a pivot table with aggregated data.

11.: How can you sort a DataFrame df based on values in the column 'column_name' in ascending order?

Ans :- df.sort_values('column_name', ascending=True)

In [15]:
df.sort_values('Deaths',ascending=True).head()

,Date,State,Region,Confirmed,Deaths,Recovered
126,4/29/2020,NaN,Papua New Guinea,8,0,0
279,4/29/2020,Prince Edward Island,Canada,27,0,0
135,4/29/2020,NaN,Rwanda,225,0,98
272,4/29/2020,Northwest Territories,Canada,5,0,0
271,4/29/2020,Northern Territory,Australia,28,0,25

12.: What does the map() function do in Pandas?

Ans :- Applies a function element-wise to a Series.

13.: How can you convert a DataFrame df to a CSV file named 'output.csv'?

Ans :- df.to_csv('output.csv')

In [17]:
df.to_csv("C:\\Users\\Pranit Ganar\\Desktop\\pr\\deaths_ascending.csv")

14.: What does the iloc[] attribute in Pandas do?

Ans :- Retrieves data based on row and column indices.

In [22]:
df.iloc[5:10,2]

5    Antigua and Barbuda
6              Argentina
7                Armenia
8                Austria
9             Azerbaijan
Name: Region, dtype: object

15.: How can you calculate the correlation matrix for a DataFrame df?

Ans :-  df.corr()

In [23]:
df.corr()

           Confirmed    Deaths  Recovered
Confirmed   1.000000  0.907294   0.596008
Deaths      0.907294  1.000000   0.519295
Recovered   0.596008  0.519295   1.000000

16.: What does the apply() function in Pandas do?

Ans :- All of the above.

17.: How can you create a new column 'new_column' in a DataFrame df that contains the sum of two existing columns 'col1' and 'col2'?

Ans :- df['new_column'] = df['col1'] + df['col2']

In [24]:
df['add_recover_death'] = df['Deaths'] + df['Recovered']
df.head()

,Date,State,Region,Confirmed,Deaths,Recovered,add_recover_death
0,4/29/2020,NaN,Afghanistan,1939,60,252,312
1,4/29/2020,NaN,Albania,766,30,455,485
2,4/29/2020,NaN,Algeria,3848,444,1702,2146
3,4/29/2020,NaN,Andorra,743,42,423,465
4,4/29/2020,NaN,Angola,27,2,7,9

18.: What does the describe() function in Pandas do?

Ans :- Returns summary statistics of a DataFrame.

In [25]:
df.describe()

           Confirmed        Deaths      Recovered  add_recover_death
count     321.000000    321.000000     321.000000         321.000000
mean     9949.800623    709.152648    3030.277259        3739.429907
std     31923.853086   3236.162817   14364.870365       16281.990961
min         0.000000      0.000000       0.000000           0.000000
25%       104.000000      2.000000       2.000000          27.000000
50%       653.000000     12.000000      73.000000         204.000000
75%      4655.000000    144.000000     587.000000         995.000000
max    299691.000000  27682.000000  132929.000000      157204.000000

19.: How can you calculate the cumulative sum of a DataFrame df along the columns?

Ans :- df.cumsum(axis=1)

20.: What does the duplicated() function in Pandas do?

Ans :- Identifies duplicate rows in a DataFrame.

In [29]:
df.duplicated().sum()

0

21.: How can you extract the unique values from a specific column 'column_name' in a DataFrame df?

Ans :- df['column_name'].unique()

In [32]:
df['State'].unique()

array([nan, 'Alabama', 'Alaska', 'Alberta', 'Anguilla', 'Anhui',
       'Arizona', 'Arkansas', 'Aruba', 'Australian Capital Territory',
       'Beijing', 'Bermuda', 'Bonaire, Sint Eustatius and Saba',
       'British Columbia', 'British Virgin Islands', 'California',
       'Cayman Islands', 'Channel Islands', 'Chongqing', 'Colorado',
       'Connecticut', 'Curacao', 'Delaware',
       'Diamond Princess cruise ship', 'District of Columbia',
       'Falkland Islands (Malvinas)', 'Faroe Islands', 'Florida',
       'French Guiana', 'French Polynesia', 'Fujian', 'Gansu', 'Georgia',
       'Gibraltar', 'Grand Princess', 'Greenland', 'Guadeloupe', 'Guam',
       'Guangdong', 'Guangxi', 'Guizhou', 'Hainan', 'Hawaii', 'Hebei',
       'Heilongjiang', 'Henan', 'Hong Kong', 'Hubei', 'Hunan', 'Idaho',
       'Illinois', 'Indiana', 'Inner Mongolia', 'Iowa', 'Isle of Man',
       'Jiangsu', 'Jiangxi', 'Jilin', 'Kansas', 'Kentucky', 'Liaoning',
       'Louisiana', 'Macau', 'Maine', 'Manitoba', 'Martinique',
       'Maryland', 'Massachusetts', 'Mayotte', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Montserrat', 'Nebraska',
       'Nevada', 'New Brunswick', 'New Caledonia', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New South Wales', 'New York',
       'Newfoundland and Labrador', 'Ningxia', 'North Carolina',
       'North Dakota', 'Northern Mariana Islands', 'Northern Territory',
       'Northwest Territories', 'Nova Scotia', 'Ohio', 'Oklahoma',
       'Ontario', 'Oregon', 'Pennsylvania', 'Prince Edward Island',
       'Puerto Rico', 'Qinghai', 'Quebec', 'Queensland', 'Recovered',
       'Reunion', 'Rhode Island', 'Saint Barthelemy',
       'Saint Pierre and Miquelon', 'Saskatchewan', 'Shaanxi', 'Shandong',
       'Shanghai', 'Shanxi', 'Sichuan', 'Sint Maarten', 'South Australia',
       'South Carolina', 'South Dakota', 'St Martin', 'Tasmania',
       'Tennessee', 'Texas', 'Tianjin', 'Tibet',
       'Turks and Caicos Islands', 'Utah', 'Vermont', 'Victoria',
       'Virgin Islands', 'Virginia', 'Washington', 'West Virginia',
       'Western Australia', 'Wisconsin', 'Wyoming', 'Xinjiang', 'Yukon',
       'Yunnan', 'Zhejiang'], dtype=object)

22.: What does the resample() function in Pandas do?

Ans :- Aggregates data over a specific time period

23.: How can you create a new column 'new_column' in a DataFrame df that contains the row-wise mean of all columns?

Ans :-  df['new_column'] = df.mean(axis=1)

In [34]:
df["mean_row_wise"]=df.mean(axis=1)
df.head()

C:\Users\Pranit Ganar\AppData\Local\Temp\ipykernel_7136\662288383.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df["mean_row_wise"]=df.mean(axis=1)

,Date,State,Region,Confirmed,Deaths,Recovered,add_recover_death,mean_row_wise
0,4/29/2020,NaN,Afghanistan,1939,60,252,312,640.75
1,4/29/2020,NaN,Albania,766,30,455,485,434.00
2,4/29/2020,NaN,Algeria,3848,444,1702,2146,2035.00
3,4/29/2020,NaN,Andorra,743,42,423,465,418.25
4,4/29/2020,NaN,Angola,27,2,7,9,11.25

24.: What does the transform() function in Pandas do?

Ans :- Applies a function element-wise to a DataFrame.

25.: How can you calculate the z-scores of a specific column 'column_name' in a DataFrame df?

Ans :- All of the above  z= x−μ/σ x is the value of the data point.μ is the mean of the dataset.σ is the standard deviation of the dataset

In [ ]:
df.zs

26.: What does the drop_duplicates() function in Pandas do?

Ans :- Drops duplicate rows from a DataFrame.

In [37]:
df.drop_duplicates().head()

,Date,State,Region,Confirmed,Deaths,Recovered,add_recover_death,mean_row_wise
0,4/29/2020,NaN,Afghanistan,1939,60,252,312,640.75
1,4/29/2020,NaN,Albania,766,30,455,485,434.00
2,4/29/2020,NaN,Algeria,3848,444,1702,2146,2035.00
3,4/29/2020,NaN,Andorra,743,42,423,465,418.25
4,4/29/2020,NaN,Angola,27,2,7,9,11.25

27.: How can you calculate the element-wise product of two DataFrames df1 and df2?

Ans :- df1 * df2

28.: What does the ffill() function in Pandas do?

Ans :- Fills missing values forward (from top to bottom) in a DataFrame.

In [39]:
df.ffill().head()

,Date,State,Region,Confirmed,Deaths,Recovered,add_recover_death,mean_row_wise
0,4/29/2020,NaN,Afghanistan,1939,60,252,312,640.75
1,4/29/2020,NaN,Albania,766,30,455,485,434.00
2,4/29/2020,NaN,Algeria,3848,444,1702,2146,2035.00
3,4/29/2020,NaN,Andorra,743,42,423,465,418.25
4,4/29/2020,NaN,Angola,27,2,7,9,11.25

29.: How can you create a pivot table with multiple aggregation functions for a DataFrame df?

Ans :- df.pivot_table(values='value_column', index='index_column', columns='columns_column', aggfunc=['sum', 'mean'])

30.: What does the cut() function in Pandas do?

Ans :- Categorizes continuous data into intervals or bins.

31.: How can you handle missing values in a DataFrame df by filling them with the mean value of the column?

Ans :- df.fillna(df.mean())

In [41]:
df.fillna(df.mean()).head()

C:\Users\Pranit Ganar\AppData\Local\Temp\ipykernel_7136\3491153192.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean()).head()

,Date,State,Region,Confirmed,Deaths,Recovered,add_recover_death,mean_row_wise
0,4/29/2020,NaN,Afghanistan,1939,60,252,312,640.75
1,4/29/2020,NaN,Albania,766,30,455,485,434.00
2,4/29/2020,NaN,Algeria,3848,444,1702,2146,2035.00
3,4/29/2020,NaN,Andorra,743,42,423,465,418.25
4,4/29/2020,NaN,Angola,27,2,7,9,11.25

32.: What does the applymap() function in Pandas do?

Ans :-  Applies a function element-wise to a DataFrame.

33.MCQ: How can you replace all occurrences of a specific value (e.g., 'old_value') in a DataFrame df with a new value (e.g., 'new_value')?

Ans :- df.replace('old_value', 'new_value', inplace=True)

34.: What does the merge_asof() function in Pandas do?

Ans :- Merges two DataFrames based on the closest match to a key column.

35.: How can you calculate the percentage change of a DataFrame df along the columns?

Ans :- df.pct_change()

36.: What does the dt accessor in Pandas do?

Ans :-  Provides access to datetime properties and methods in a Series.

37.: How can you perform element-wise subtraction of two DataFrames df1 and df2 and replace missing values with 0?

Ans :- df1.sub(df2, fill_value=0)

38.: What does the to_datetime() function in Pandas do

Ans :- Converts a Series to a datetime data type.

39.: How can you select rows from a DataFrame df where the values in column 'column_name' are not null?

Ans :- All of the above

40.: What does the query() function in Pandas do?

Ans :- Selects rows from a DataFrame based on a query string.